return {
  {
    "goolord/alpha-nvim",
    dependencies = { "nvim-tree/nvim-web-devicons" },
    config = function()
      local alpha = require("alpha")
      local dashboard = require("alpha.themes.dashboard")

      dashboard.section.header.val = {
        "███╗   ███╗ ██████╗██╗      █████╗ ██████╗ ███████╗███╗   ██╗",
        "████╗ ████║██╔════╝██║     ██╔══██╗██╔══██╗██╔════╝████╗  ██║",
        "██╔████╔██║██║     ██║     ███████║██████╔╝█████╗  ██╔██╗ ██║",
        "██║╚██╔╝██║██║     ██║     ██╔══██║██╔══██╗██╔══╝  ██║╚██╗██║",
        "██║ ╚═╝ ██║╚██████╗███████╗██║  ██║██║  ██║███████╗██║ ╚████║",
        "╚═╝     ╚═╝ ╚═════╝╚══════╝╚═╝  ╚═╝╚═╝  ╚═╝╚══════╝╚═╝  ╚═══╝",
        "",
        "Neovim // McLaren Edition",
      }

      dashboard.section.buttons.val = {
        dashboard.button("e", "  New file", "<cmd>ene<CR>"),
        dashboard.button("SPC ff", "󰱼  Find file"),
        dashboard.button("SPC fg", "󰱼  Live grep"),
        dashboard.button("SPC e", "  File explorer"),
        dashboard.button("q", "  Quit", "<cmd>qa<CR>"),
      }

      alpha.setup(dashboard.opts)
    end,
  },
}
